In [379]:
import pandas as pd
import os
csvpath=os.path.join("..", "purchase_data.csv")

In [380]:

dataframe=pd.read_csv(csvpath)
dataframe.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
5,5,Yalae81,22,Male,81,Dreamkiss,3.61
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67
8,8,Undjask33,22,Male,21,Souleater,1.10
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58

In [275]:
#Total Players 
unique_pcat=dataframe["SN"].unique()
len(unique_pcat)

576

# Player Count
Total Number of Players

In [283]:
#Summary dataframe for total players
totalplayers_summary = pd.DataFrame({"Total Players":[len(unique_pcat)]})
totalplayers_summary.head()

   Total Players
0            576

In [15]:
print(dataframe["SN"].value_counts())

Lisosia93       5
Idastidru52     4
Iral74          4
Saedaiphos46    3
Pheodaisun84    3
               ..
Mindimnya67     1
Hallysucal81    1
Jiskjask85      1
Aenarap34       1
Mindista32      1
Name: SN, Length: 576, dtype: int64

In [16]:
 #Return the Average of purchase price, number of unique items, Total number of purchases, Total Revenue


dataframe["Price"].mean()

3.050987179487176

In [17]:
dataframe["Purchase ID"].count()

780

In [18]:
dataframe["Price"].sum()

2379.77

In [250]:
unique_pcat=dataframe["Item ID"].unique()
len(unique_pcat)

179

# Purchasing Analysis (Total)
Run basic calculations to obtain number of unique items, average price, etc.
Create a summary data frame to hold the results
Display the summary data frame

In [267]:
#summary dataframe Purchasing TOTALS 
totalpurchasing_summary = pd.DataFrame({"Number of Unique Items":[len(unique_pcat)] ,
                                    "Average Price": dataframe["Price"].mean(), "Number of Purchase": dataframe["Purchase ID"].count(),
                                        "Total Revenue": dataframe["Price"].sum(),
                                      })
totalpurchasing_summary.head()
#unique_pcat=

   Number of Unique Items  Average Price  Number of Purchase  Total Revenue
0                     179       3.050987                 780        2379.77

In [20]:
#Percentage and Count of Male Players, Percentage and count of female players, percentage and count of other/non-disclosed
unique_pcat=dataframe["Gender"].unique()
len(unique_pcat)

3

In [400]:
#Purchasing Analysis (Gender) Purchase Count, Average Purchase Price, 
#Total Purchase Value, Average Purchase Total per person by Age Group
type(dataframe["Gender"].value_counts())

pandas.core.series.Series

In [22]:
#Continuation of above, extract 
dataframe_type_df = dataframe[["Gender", "SN", "Price"]]
dataframe_type_df.head(10)

                  Gender             SN  Price
0                   Male        Lisim78   3.53
1                   Male    Lisovynya38   1.56
2                   Male     Ithergue48   4.88
3                   Male  Chamassasya86   3.27
4                   Male      Iskosia90   1.44
5                   Male        Yalae81   3.61
6                   Male      Itheria73   2.18
7                   Male    Iskjaskst81   2.67
8                   Male      Undjask33   1.10
9  Other / Non-Disclosed    Chanosian48   3.58

In [402]:
# Average Purchase Price
Gender_group = dataframe_type_df.groupby(["Gender"])

Gender_comparison_df = Gender_group.mean()["Price"]
Gender_comparison_df

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [24]:
#Total Purchase Value
Gender_group = dataframe_type_df.groupby(["Gender"])

Gender_comparison_df = Gender_group.sum()
Gender_comparison_df

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

# Purchasing Analysis (Gender)
Run basic calculations to obtain purchase count, avg. purchase price, avg. Total Purchase Value by gender
Create a summary data frame to hold the results
Optional: give the displayed data cleaner formatting
Display the summary data frame

In [398]:
#Summary dataframe Purchasing Analysis (Gender) 

totalpurchasing_summary = pd.DataFrame({"Purchase Count":(dataframe["Gender"].value_counts()), 
                                    "Average Purchase Price":Gender_group.mean()["Price"],
                                        "Total Purchase Value":Gender_group.sum()["Price"]})

totalpurchasing_summary.head()

,Purchase Count,Average Purchase Price,Total Purchase Value
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [62]:
unique_players_df = dataframe[["Gender", "SN", "Age"]]
unique_players_df = unique_players_df.drop_duplicates()
unique_players_df.count()

Gender    576
SN        576
Age       576
dtype: int64

In [176]:
unique_players_df["Gender"].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [64]:
unique_players_df["Gender"].value_counts()/576

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

# Gender Demographics
Percentage and Count of Male Players
Percentage and Count of Female Players
Percentage and Count of Other / Non-Disclosed

In [256]:
#Summary dataframe for Gender Demographics 
Gender_summary = pd.DataFrame({"Total Count": unique_players_df["Gender"].value_counts(),
                                    "Percentage of Players":unique_players_df["Gender"].value_counts()/576})
Gender_summary.head()

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [80]:
# Age Demographics dataframe
Age_breakdown_df = dataframe[["SN", "Age",]]
Age_breakdown_df.head (10)

              SN  Age
0        Lisim78   20
1    Lisovynya38   40
2     Ithergue48   24
3  Chamassasya86   24
4      Iskosia90   23
5        Yalae81   22
6      Itheria73   36
7    Iskjaskst81   20
8      Undjask33   22
9    Chanosian48   35

In [86]:
Age_demo = dataframe.loc[:,["Gender","SN","Age"]]
Age_demo = Age_demo.drop_duplicates()
Age_demo.head(10)

                  Gender             SN  Age
0                   Male        Lisim78   20
1                   Male    Lisovynya38   40
2                   Male     Ithergue48   24
3                   Male  Chamassasya86   24
4                   Male      Iskosia90   23
5                   Male        Yalae81   22
6                   Male      Itheria73   36
7                   Male    Iskjaskst81   20
8                   Male      Undjask33   22
9  Other / Non-Disclosed    Chanosian48   35

In [81]:
dataframe_type_df.head()

  Gender             SN  Price
0   Male        Lisim78   3.53
1   Male    Lisovynya38   1.56
2   Male     Ithergue48   4.88
3   Male  Chamassasya86   3.27
4   Male      Iskosia90   1.44

In [87]:
#Age Demographics -creating bins and labels
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
hp_labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
Age_demo["Age_ranges"] = pd.cut(Age_demo["Age"], age_bins, labels=hp_labels)

In [88]:
# Calculate the Numbers by Age Group
Age_group_totals = Age_demo["Age_ranges"].value_counts()

print(Age_group_totals)

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age_ranges, dtype: int64

In [90]:
Age_group_totals=Age_demo["Age_ranges"].value_counts()/576
print (Age_group_totals)

20-24    0.447917
15-19    0.185764
25-29    0.133681
30-34    0.090278
35-39    0.053819
10-14    0.038194
<10      0.029514
40+      0.020833
Name: Age_ranges, dtype: float64

# Age Demographics
Establish bins for ages
Categorize the existing players using the age bins. Hint: use pd.cut()
Calculate the numbers and percentages by age group
Create a summary data frame to hold the results

Display Age Demographics Table

In [339]:
#summary Dataframe for Age Demographics
AgeDemographics_summary = pd.DataFrame({"Total Count":Age_demo["Age_ranges"].value_counts(), 
                                        "Percentage of Players": Age_demo["Age_ranges"].value_counts()/576 
                        })
AgeDemographics_summary.head(8)

       Total Count  Percentage of Players
20-24          258               0.447917
15-19          107               0.185764
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
10-14           22               0.038194
<10             17               0.029514
40+             12               0.020833

In [98]:
#Purchasing Analysis (Age)
#data frame created 
Purchasing_data = dataframe.loc[:,["SN","Price", "Age"]]

Purchasing_data.head(10)

              SN  Price  Age
0        Lisim78   3.53   20
1    Lisovynya38   1.56   40
2     Ithergue48   4.88   24
3  Chamassasya86   3.27   24
4      Iskosia90   1.44   23
5        Yalae81   3.61   22
6      Itheria73   2.18   36
7    Iskjaskst81   2.67   20
8      Undjask33   1.10   22
9    Chanosian48   3.58   35

In [99]:
#create bins
#Age Demographics -creating bins and labels
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
hp_labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
Purchasing_data["Age_ranges"] = pd.cut(Purchasing_data["Age"], age_bins, labels=hp_labels)

In [103]:
#Purchase count
Purchasing_group_totals = Purchasing_data["Age_ranges"].value_counts()

print(Purchasing_group_totals)

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Age_ranges, dtype: int64

In [414]:
#Average Purchase Price
Purchasing_group_totals = Purchasing_data.groupby(["Age_ranges"])
Purchasing_comparison_df=Purchasing_group_totals.mean()["Price"]

Purchasing_comparison_df

Age_ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [132]:
#Total Purchase Value
Purchasing_group_totals = Purchasing_data.groupby(["Age_ranges"])
Purchasing_comparison_df=Purchasing_group_totals.sum()
Purchasing_comparison_df

              Price   Age
Age_ranges
<10           77.13   181
10-14         82.78   319
15-19        412.89  2284
20-24       1114.06  7971
25-29        293.00  2626
30-34        214.00  2291
35-39        147.67  1505
40+           38.24   540

# Purchasing Analysis (Age)
Bin the purchase_data data frame by age
Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
Create a summary data frame to hold the results

Display the summary data frame

In [415]:

#Summary dataframe for Purchase Analysis by Age 
Purchasing_totals=pd.DataFrame({"Purchase Count":Purchasing_data["Age_ranges"].value_counts(),
                              "Average Purchase Price":Purchasing_group_totals.mean()["Price"],
                               "Total Purchase Value":Purchasing_group_totals.sum()["Price"]}) 
                             
                                   
Purchasing_totals.head()

       Purchase Count  Average Purchase Price  Total Purchase Value
<10                23                3.353478                 77.13
10-14              28                2.956429                 82.78
15-19             136                3.035956                412.89
20-24             365                3.052219               1114.06
25-29             101                2.900990                293.00

# Top Spenders
-Run basic calculations to obtain the results in the table below
-Create a summary data frame to hold the results
-Sort the total purchase value column in descending order
-Display a preview of the summary data frame

In [331]:
purchase_count=dataframe.groupby('SN')['Purchase ID'].nunique()
t_s_df = purchase_count.to_frame('Purchase Count')

t_s_p_value = dataframe.groupby('SN')['Price'].sum()
t_s_df['Average Purchase Price'] = (t_s_p_value/t_s_df['Purchase Count']).map("${:.2f}".format)
t_s_df['Total Purchase Value'] = t_s_p_value

n_ts_df = t_s_df.sort_values(by='Total Purchase Value', ascending=False)
n_ts_df['Total Purchase Value'] = n_ts_df['Total Purchase Value'].map("${:.2f}".format)
n_ts_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

# Most Popular Items
-Retrieve the Item ID, Item Name, and Item Price columns
-Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase vaule
-Create a summary data frame to hold the results
-Sort the purchase count column in descending order
-Display in summary data frame

In [375]:
m_p_items = dataframe.filter(['Item ID', 'Item Name','Price'], axis=1)
item_price = m_p_items.groupby(['Item ID','Item Name'])['Price'].mean()
purchase_count = m_p_items.groupby('Item ID')['Item Name'].value_counts()
purchase_value = item_price * purchase_count

m_p_df = purchase_count.to_frame('Purchase Count')
m_p_df['Item Price'] = item_price.map("${:.2f}".format)
m_p_df['Total Purchase Value'] = purchase_value
m_p_df1 = m_p_df.sort_values(by="Purchase Count", ascending=False)
m_p_df1['Total Purchase Value'] = m_p_df1['Total Purchase Value'].map("${:.2f}".format)
m_p_df1.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

# Most Profitable Items
Sort the above table by total purchase value in descending order
Display a preview of the data frame

In [416]:
m_p_df2 = m_p_df.sort_values("Total Purchase Value", ascending=False)
m_p_df2['Total Purchase Value'] = m_p_df2['Total Purchase Value'].map("${:.2f}".format)
m_p_df2.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

# Conclusion

The three observations I made based on this analysis was that the majority of players are males between the ages of 15-24  and male players had a higher purchase count and higher purchasing values. However the optional items to enhance their playing experience is probably not covering the cost that it took to create the game since the total purchase values are not very high. One reason could be the age group the game is most popular too is probably not fully employed which means maybe the game might be bringing in looses and/or the acceseries to enhance the game are not appealing to that age group. More information would be needed to see if this game was worth it.